set_route_zrt_common_options -max_layer M8

route_global
route_detail
route_opt

check_routes
check_drc

save_block -as route_done
